In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [20]:
# Series
pd.Series([4,2,np.nan,5.3, 'apple'])

0    4
1    2
2    5
dtype: int64

In [25]:
# DataFrame
nparr = np.random.randn(3,4)
pd.DataFrame(nparr, index=[3,5,7], columns=[11,13,17,19])

         11        13        17        19
3 -0.446983 -2.007278  1.151770  1.902337
5  0.628870 -0.095474 -0.597351  0.108642
7  0.726589  0.618988 -1.171513  0.356211

In [37]:
# Create DataFrame from dict
df = pd.DataFrame({
    'A': 1,
    'B': 'yolo',
    'C': pd.Series(1, index=list(range(4))),
    'D': np.array(list(range(4)))
})

   A     B  C  D
0  1  yolo  1  0
1  1  yolo  1  1
2  1  yolo  1  2
3  1  yolo  1  3

In [39]:
df.dtypes

A     int64
B    object
C     int64
D     int64
dtype: object

In [47]:
df.head()

   A     B  C  D
0  1  yolo  1  0
1  1  yolo  1  1
2  1  yolo  1  2
3  1  yolo  1  3

In [48]:
df.tail(2)

   A     B  C  D
2  1  yolo  1  2
3  1  yolo  1  3

In [53]:
df.index, df.columns, df.values

numpy.ndarray

In [52]:
df.describe()

         A    C         D
count  4.0  4.0  4.000000
mean   1.0  1.0  1.500000
std    0.0  0.0  1.290994
min    1.0  1.0  0.000000
25%    1.0  1.0  0.750000
50%    1.0  1.0  1.500000
75%    1.0  1.0  2.250000
max    1.0  1.0  3.000000

In [60]:
df.T

      0     1     2     3
A     1     1     1     1
B  yolo  yolo  yolo  yolo
C     1     1     1     1
D     0     1     2     3

In [62]:
df.sort_index(axis=1, ascending=False)

   D  C     B  A
0  0  1  yolo  1
1  1  1  yolo  1
2  2  1  yolo  1
3  3  1  yolo  1

In [63]:
df.sort_values(by='D', ascending=False)

   A     B  C  D
3  1  yolo  1  3
2  1  yolo  1  2
1  1  yolo  1  1
0  1  yolo  1  0

In [66]:
df.columns

Index([u'A', u'B', u'C', u'D'], dtype='object')